src/DataProcessors/ДоступностьВидовРабочихЦентров/ДоступностьВидовРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДоступностьВидовРабочихЦентров</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/ДоступностьВидовРабочихЦентров/ДоступностьВидовРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоступностьВидовРабочихЦентров</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Занято</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступностьПоВидуРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступностьПоРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МаксимальнаяДоступность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДоступностьПоВидуРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСтрокиПродукция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСтрокиЭтапыГрафик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНаладки</name>
    <type>
      <types>CatalogRef.ВариантыНаладки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДвижениеВводаДоступности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДвижениеЗаказаНаПроизводство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДвижениеМаршрутногоЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидРабочегоЦентра</name>
    <type>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИнтервала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ДоступностьРабочихЦентров/ДоступностьРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоступностьРабочихЦентров</name>
  <registerRecords>InformationRegister.ДоступностьРабочихЦентров</registerRecords>
  <registerRecords>AccumulationRegister.ДоступностьВидовРабочихЦентров</registerRecords>
  <registerRecords>AccumulationRegister.СостоянияРабочихЦентров</registerRecords>
  <attributes>
    <name>ВидРабочегоЦентра</name>
    <type>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнесеныРучныеИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГрафика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Интервалы</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаГрафика</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доступность</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеныРучныеИзменения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбособленногоУчетаТоваров</name>
    <type>
      <types>EnumRef.ВариантыОбособленногоУчетаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПланирования</name>
    <type>
      <types>EnumRef.ТочностьГрафикаПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеМаршрутнымиЛистами</name>
    <type>
      <types>EnumRef.УправлениеМаршрутнымиЛистами</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПооперационногоУправления</name>
    <type>
      <types>EnumRef.СпособыУправленияОперациями</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСебестоимостьПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоБезЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписаниеЗатратНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияПолуфабрикатов</name>
    <type>
      <types>EnumRef.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеУправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМатериалыВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВыходныеИзделияВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОформленияВыработки</name>
    <type>
      <types>EnumRef.ПериодичностьОформленияВыработкиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКТУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТарифныеСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтработанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБригадныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПерсональныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНастройкиГрафикаРаботы</name>
    <type>
      <types>EnumRef.СпособыНастройкиГрафикаРаботыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСменныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныеУчастки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикиРаботы</name>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ДоступностьВидовРабочихЦентров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область СлужебныеЭкспортныеПроцедурыИФункции

// Функция-конструктор таблицы расписания графиков работы РЦ
// 
// Возвращаемое значение:
// 	ТаблицаЗначений - Описание:
// * ВидРабочегоЦентра - СправочникСсылка.ВидыРабочихЦентров - вид рабочего центра
// * РабочийЦентр - СправочникСсылка.РабочиеЦентры - рабочий центр
// * ДатаГрафика - Дата - дата по графику
// * ВремяНачала - Дата - время начала по графику
// * ВремяОкончания - Дата - время окончания по графику
// * Количество - Число - количество
// * ВнесеныРучныеИзменения - Булево - признак, в расписание внесены ручные изменения
//
Функция СоздатьТаблицуРасписаниеГрафиковРаботыРЦ() Экспорт

	РасписаниеГрафиковРаботыРЦ = Новый ТаблицаЗначений;
	РасписаниеГрафиковРаботыРЦ.Колонки.Добавить("ВидРабочегоЦентра", Новый ОписаниеТипов("СправочникСсылка.ВидыРабочихЦентров"));
	РасписаниеГрафиковРаботыРЦ.Колонки.Добавить("РабочийЦентр", Новый ОписаниеТипов("СправочникСсылка.РабочиеЦентры"));
	РасписаниеГрафиковРаботыРЦ.Колонки.Добавить("ДатаГрафика", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	РасписаниеГрафиковРаботыРЦ.Колонки.Добавить("ВремяНачала", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	РасписаниеГрафиковРаботыРЦ.Колонки.Добавить("ВремяОкончания", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	РасписаниеГрафиковРаботыРЦ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный)));
	РасписаниеГрафиковРаботыРЦ.Колонки.Добавить("ВнесеныРучныеИзменения", Новый ОписаниеТипов("Булево"));

	Возврат РасписаниеГрафиковРаботыРЦ;
	
КонецФункции

Функция ЗаполнитьГрафикиРаботыРЦ(ВидРабочегоЦентра, ДанныеПоРЦ, НачалоПериода, ОкончаниеПериода, РасписаниеГрафиковРаботыРЦ) Экспорт
	
	РасписаниеГрафиковРаботыРЦКопия = РасписаниеГрафиковРаботыРЦ.Скопировать();
	
	// Удалим старые данные по указанным РЦ
	СтруктураПоиска = Новый Структура("ВидРабочегоЦентра", ВидРабочегоЦентра);
 	СтарыеДанныеПоВидуРЦ = РасписаниеГрафиковРаботыРЦ.НайтиСтроки(СтруктураПоиска);
	
	// Получим расписания работы
	СписокГрафиков = Новый Массив;
	Для каждого СтрокаРЦ Из ДанныеПоРЦ Цикл
		Для каждого ГрафикРаботы Из СтрокаРЦ.ГрафикиРаботы Цикл
			Если СписокГрафиков.Найти(ГрафикРаботы) = Неопределено Тогда
				СписокГрафиков.Добавить(ГрафикРаботы);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	РасписанияРаботы = ПланированиеПроизводства.РасписаниеРаботыПоГрафику(СписокГрафиков, НачалоПериода, ОкончаниеПериода);
	
	СведенияОНовойДоступности = Новый ТаблицаЗначений;
	СведенияОНовойДоступности.Колонки.Добавить("РабочийЦентр", Новый ОписаниеТипов("СправочникСсылка.РабочиеЦентры"));
	СведенияОНовойДоступности.Колонки.Добавить("ДатаГрафика", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	СведенияОНовойДоступности.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный)));
	СведенияОНовойДоступности.Колонки.Добавить("КоэффициентВремениРаботы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный)));
	
	Для каждого СтрокаРЦ Из ДанныеПоРЦ Цикл
		
		// Удалим старые данные по РЦ
		МассивУдаленныхСтрок = Новый Массив;
		Для ИндексСтроки = 0 По СтарыеДанныеПоВидуРЦ.ВГраница() Цикл
			СтрокаРасписание = СтарыеДанныеПоВидуРЦ[ИндексСтроки];
			Если СтрокаРасписание.ДатаГрафика >= НачалоПериода 
				И СтрокаРасписание.ДатаГрафика <= ОкончаниеПериода 
				И СтрокаРасписание.РабочийЦентр = СтрокаРЦ.РабочийЦентр Тогда
				
				РасписаниеГрафиковРаботыРЦ.Удалить(СтрокаРасписание);
				МассивУдаленныхСтрок.Добавить(ИндексСтроки);
			КонецЕсли;
		КонецЦикла;
		
		Для ИндексСтроки = -МассивУдаленныхСтрок.ВГраница() По 0 Цикл
			СтарыеДанныеПоВидуРЦ.Удалить(МассивУдаленныхСтрок[-ИндексСтроки]);
		КонецЦикла; 
		
		// Добавим новые
		ДатаПериода = НачалоПериода;
		Пока ДатаПериода <= ОкончаниеПериода Цикл
			
			Интервалы = Новый Массив;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ДатаГрафика", ДатаПериода);
			
			Для каждого ГрафикРаботы Из СтрокаРЦ.ГрафикиРаботы Цикл
				
				СтруктураПоиска.Вставить("ГрафикРаботы", ГрафикРаботы);
	  			РасписаниеПоГрафику = РасписанияРаботы.НайтиСтроки(СтруктураПоиска);
				
				Для каждого СтрокаИнтервал Из РасписаниеПоГрафику Цикл
					
					// Проверка пересечения интервалов
					Для каждого Интервал Из Интервалы Цикл
						Если СтрокаИнтервал.ВремяНачала >= Интервал.ВремяНачала И СтрокаИнтервал.ВремяНачала < Интервал.ВремяОкончания
							ИЛИ СтрокаИнтервал.ВремяОкончания > Интервал.ВремяНачала И СтрокаИнтервал.ВремяОкончания <= Интервал.ВремяОкончания
							ИЛИ СтрокаИнтервал.ВремяНачала < Интервал.ВремяНачала И СтрокаИнтервал.ВремяОкончания > Интервал.ВремяОкончания Тогда
							
							ТекстСообщения = СтрШаблон(НСтр("ru = 'Графики работы рабочего центра ""%1"" пересекаются %2.';
															|en = 'Work schedules of the ""%1"" work center overlap %2.'"),
								СтрокаРЦ.РабочийЦентр,
								Формат(ДатаПериода, "ДЛФ=D"));
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, СтрокаРЦ.РабочийЦентр);
							
							РасписаниеГрафиковРаботыРЦ = РасписаниеГрафиковРаботыРЦКопия;
							Возврат Неопределено;
							
						КонецЕсли;
					КонецЦикла;
					
					СтрокаРасписание = РасписаниеГрафиковРаботыРЦ.Добавить();
					СтрокаРасписание.ВидРабочегоЦентра = ВидРабочегоЦентра;
					СтрокаРасписание.РабочийЦентр = СтрокаРЦ.РабочийЦентр;
					СтрокаРасписание.ДатаГрафика = СтрокаИнтервал.ДатаГрафика;
					СтрокаРасписание.ВремяНачала = СтрокаИнтервал.ВремяНачала;
					СтрокаРасписание.ВремяОкончания = СтрокаИнтервал.ВремяОкончания;
					СтрокаРасписание.Количество = СтрокаИнтервал.Длительность;
					
					Интервалы.Добавить(СтрокаРасписание);
					
					НоваяДоступность = СведенияОНовойДоступности.Добавить();
					НоваяДоступность.РабочийЦентр = СтрокаРЦ.РабочийЦентр;
					НоваяДоступность.ДатаГрафика = СтрокаИнтервал.ДатаГрафика;
					НоваяДоступность.Количество = СтрокаИнтервал.Длительность;
					НоваяДоступность.КоэффициентВремениРаботы = СтрокаРЦ.КоэффициентВремениРаботы;
				КонецЦикла;
				
			КонецЦикла;
			
			Если Интервалы.Количество() = 0 Тогда
				
				СтрокаРасписание = РасписаниеГрафиковРаботыРЦ.Добавить();
				СтрокаРасписание.ВидРабочегоЦентра = ВидРабочегоЦентра;
				СтрокаРасписание.РабочийЦентр = СтрокаРЦ.РабочийЦентр;
				СтрокаРасписание.ДатаГрафика = ДатаПериода;
				СтрокаРасписание.Количество = 0;
				
				НоваяДоступность = СведенияОНовойДоступности.Добавить();
				НоваяДоступность.РабочийЦентр = СтрокаРЦ.РабочийЦентр;
				НоваяДоступность.ДатаГрафика = ДатаПериода;
				НоваяДоступность.Количество = 0;
				НоваяДоступность.КоэффициентВремениРаботы = СтрокаРЦ.КоэффициентВремениРаботы;
				
			КонецЕсли; 
			
			ДатаПериода = КонецДня(ДатаПериода) + 1;
			
		КонецЦикла; 
		
	КонецЦикла; 

	Возврат СведенияОНовойДоступности;
	
КонецФункции

Функция ВидыРЦТребующиеВводаГрафикаРаботы(Подразделение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоказательВводДоступностиДляРасписанияРЦ();
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.ЗначениеПоказателя;

КонецФункции

#КонецОбласти

#Область ТекущиеДела


// Заполняет список текущих дел пользователя.
// Параметры: 
//     ТекущиеДела - см. ТекущиеДелаСервер.ТекущиеДела
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	ОбщиеПараметрыЗапросов = ТекущиеДелаСервер.ОбщиеПараметрыЗапросов();
	
	ДелоВводДоступностиДляГрафикаПроизводства(ТекущиеДела, ОбщиеПараметрыЗапросов);
	
	ДелоВводДоступностиДляРасписанияРЦ(ТекущиеДела, ОбщиеПараметрыЗапросов);
	
КонецПроцедуры


Процедура ДелоВводДоступностиДляГрафикаПроизводства(ТекущиеДела, ОбщиеПараметрыЗапросов)
	
	ИмяФормы = "Обработка.ДоступностьВидовРабочихЦентров.Форма";
	
	// Определим доступны ли текущему пользователю показатели группы
	Доступность = ПраваПользователяПовтИсп.ПравоНаВводДоступностиВидовРЦ()
					И ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство");
	
	Если НЕ Доступность Тогда
		Возврат;
	КонецЕсли;
	
	// Расчет показателей
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоказательВводДоступностиДляГрафикаПроизводства();
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	ТекущиеДелаСлужебный.УстановитьОбщиеПараметрыЗапросов(Запрос, ОбщиеПараметрыЗапросов);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	// Заполнение дел.
	// ВидыРЦТребующиеВводаДоступности
	ДелоРодитель = ТекущиеДела.Добавить();
	ДелоРодитель.Идентификатор  = "ВидыРЦТребующиеВводаДоступности";
	ДелоРодитель.Представление  = НСтр("ru = 'Виды рабочих центров, требующие ввода доступности';
										|en = 'Work center types with manual capacity'");
	ДелоРодитель.Владелец       = Метаданные.Подсистемы.Производство;
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("РежимРаботы", Перечисления.РежимыРедактированияДоступностиВидовРЦ.ВводДоступностиДляФормированияГрафикаПроизводства);
		ПараметрыОтбора.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
		
		ПредставлениеДела = "";
		ИдентификаторДела = "";
		ЗначениеДела      = 0;
		Для Каждого КолонкаРезультата Из Результат.Колонки Цикл
			ЗначениеКолонки = СтрокаРезультата[КолонкаРезультата.Имя];
			Если КолонкаРезультата.Имя = "ЗначениеПоказателя" Тогда
				ЗначениеДела = ЗначениеКолонки;
				Продолжить;
			КонецЕсли;
			ПредставлениеДела = ?(ПредставлениеДела = "", "", ", ") + Строка(ЗначениеКолонки);
			ИдентификаторДела = ?(ИдентификаторДела = "", ДелоРодитель.Идентификатор, ИдентификаторДела)
				+ СтрЗаменить(Строка(ЗначениеКолонки), " ", "");
			ПараметрыОтбора.Вставить(КолонкаРезультата.Имя, ЗначениеКолонки);
		КонецЦикла;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИдентификаторДела;
		Дело.ЕстьДела       = ЗначениеДела > 0;
		Дело.Представление  = ПредставлениеДела;
		Дело.Количество     = ЗначениеДела;
		Дело.Важное         = Ложь;
		Дело.Форма          = ИмяФормы;
		Дело.ПараметрыФормы = Новый Структура("СтруктураБыстрогоОтбора", ПараметрыОтбора);
		Дело.Владелец       = "ВидыРЦТребующиеВводаДоступности";
		
		Если ЗначениеДела > 0 Тогда
			ДелоРодитель.ЕстьДела = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДелоВводДоступностиДляРасписанияРЦ(ТекущиеДела, ОбщиеПараметрыЗапросов)
	
	ИмяФормы = "Обработка.ДоступностьВидовРабочихЦентров.Форма";
	
	// Определим доступны ли текущему пользователю показатели группы
	Доступность = ПраваПользователяПовтИсп.ПравоНаВводГрафиковРаботыРЦ()
					И ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство");
	
	Если НЕ Доступность Тогда
		Возврат;
	КонецЕсли;
	
	// Расчет показателей
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоказательВводДоступностиДляРасписанияРЦ();
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	ТекущиеДелаСлужебный.УстановитьОбщиеПараметрыЗапросов(Запрос, ОбщиеПараметрыЗапросов);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	// Заполнение дел.
	// РЦТребующиеВводаГрафикаРаботы
	ДелоРодитель = ТекущиеДела.Добавить();
	ДелоРодитель.Идентификатор  = "РЦТребующиеВводаГрафикаРаботы";
	ДелоРодитель.Представление  = НСтр("ru = 'Рабочие центры, требующие ввода графика работы';
										|en = 'Work centers which require entering the work schedule'");
	ДелоРодитель.Владелец       = Метаданные.Подсистемы.Производство;
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("РежимРаботы", Перечисления.РежимыРедактированияДоступностиВидовРЦ.ВводГрафикаРаботыРЦДляФормированияРасписанияРаботыРЦ);
		ПараметрыОтбора.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
		
		ПредставлениеДела = "";
		ИдентификаторДела = "";
		ЗначениеДела      = 0;
		Для Каждого КолонкаРезультата Из Результат.Колонки Цикл
			ЗначениеКолонки = СтрокаРезультата[КолонкаРезультата.Имя];
			Если КолонкаРезультата.Имя = "ЗначениеПоказателя" Тогда
				ЗначениеДела = ЗначениеКолонки;
				Продолжить;
			КонецЕсли;
			ПредставлениеДела = ?(ПредставлениеДела = "", "", ", ") + Строка(ЗначениеКолонки);
			ИдентификаторДела = ?(ИдентификаторДела = "", ДелоРодитель.Идентификатор, ИдентификаторДела)
				+ СтрЗаменить(Строка(ЗначениеКолонки), " ", "");
			ПараметрыОтбора.Вставить(КолонкаРезультата.Имя, ЗначениеКолонки);
		КонецЦикла;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИдентификаторДела;
		Дело.ЕстьДела       = ЗначениеДела > 0;
		Дело.Представление  = ПредставлениеДела;
		Дело.Количество     = ЗначениеДела;
		Дело.Важное         = Ложь;
		Дело.Форма          = ИмяФормы;
		Дело.ПараметрыФормы = Новый Структура("СтруктураБыстрогоОтбора", ПараметрыОтбора);
		Дело.Владелец       = "РЦТребующиеВводаГрафикаРаботы";
		
		Если ЗначениеДела > 0 Тогда
			ДелоРодитель.ЕстьДела = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Прочее

Функция ТекстЗапросаПоказательВводДоступностиДляГрафикаПроизводства()

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыЗаполнения.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ДатыЗаполнения.ВидРабочегоЦентра), 0) КАК ЗначениеПоказателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВидыРабочихЦентров.Подразделение КАК Подразделение,
	|		ВидыРабочихЦентров.Ссылка КАК ВидРабочегоЦентра,
	|		ЕСТЬNULL(МАКСИМУМ(ДоступностьВидовРабочихЦентров.ДатаИнтервала), ДАТАВРЕМЯ(1, 1, 1)) КАК ЗаполненоПо
	|	ИЗ
	|		Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
	|			ПО ВидыРабочихЦентров.Подразделение = СтруктураПредприятия.Ссылка
	|				И ВидыРабочихЦентров.УчитыватьДоступностьПоГрафикуРаботы
	|				И НЕ ВидыРабочихЦентров.ПометкаУдаления
	|				И НЕ ВидыРабочихЦентров.ЭтоГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДоступностьВидовРабочихЦентров КАК ДоступностьВидовРабочихЦентров
	|			ПО (ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра = ВидыРабочихЦентров.Ссылка)
	|				И (ДоступностьВидовРабочихЦентров.ЭтоДвижениеВводаДоступности)
	|				И (ВидыРабочихЦентров.ВводитьДоступностьДляВидаРЦ
	|						И ДоступностьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ДоступностьВидаРабочихЦентров
	|					ИЛИ НЕ ВидыРабочихЦентров.ВводитьДоступностьДляВидаРЦ
	|						И ДоступностьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ДоступностьРабочихЦентров)
	|	ГДЕ
	|		СтруктураПредприятия.ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней <> 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВидыРабочихЦентров.Ссылка,
	|		ВидыРабочихЦентров.Подразделение) КАК ДатыЗаполнения
	|ГДЕ
	|	ДатыЗаполнения.ЗаполненоПо < ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, ДатыЗаполнения.Подразделение.ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней - 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыЗаполнения.Подразделение";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоказательВводДоступностиДляРасписанияРЦ()

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыЗаполнения.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ДатыЗаполнения.ВидРабочегоЦентра), 0) КАК ЗначениеПоказателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВидыРабочихЦентров.Подразделение КАК Подразделение,
	|		ВидыРабочихЦентров.Ссылка КАК ВидРабочегоЦентра,
	|		ЕСТЬNULL(МАКСИМУМ(ДоступностьВидовРабочихЦентров.ДатаИнтервала), ДАТАВРЕМЯ(1, 1, 1)) КАК ЗаполненоПо
	|	ИЗ
	|		Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
	|			ПО ВидыРабочихЦентров.Подразделение = СтруктураПредприятия.Ссылка
	|				И ВидыРабочихЦентров.ПланироватьРаботуРабочихЦентров
	|				И НЕ ВидыРабочихЦентров.ПометкаУдаления
	|				И НЕ ВидыРабочихЦентров.ЭтоГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДоступностьВидовРабочихЦентров КАК ДоступностьВидовРабочихЦентров
	|			ПО (ДоступностьВидовРабочихЦентров.ВидРабочегоЦентра = ВидыРабочихЦентров.Ссылка)
	|				И (ДоступностьВидовРабочихЦентров.ЭтоДвижениеВводаДоступности)
	|				И (ДоступностьВидовРабочихЦентров.Регистратор ССЫЛКА Документ.ДоступностьРабочихЦентров)
	|	ГДЕ
	|		СтруктураПредприятия.ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней <> 0
	|		И (СтруктураПредприятия.Ссылка = &Подразделение
	|				ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВидыРабочихЦентров.Ссылка,
	|		ВидыРабочихЦентров.Подразделение) КАК ДатыЗаполнения
	|ГДЕ
	|	ДатыЗаполнения.ЗаполненоПо < ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, ДатыЗаполнения.Подразделение.ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней - 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыЗаполнения.Подразделение";

	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
